In [1]:
import pandas as pd

In [29]:
#table1 with ID and number
table1 = pd.DataFrame({
    'ID':[1,2,3,4,5,6],
    'Name':['A','B','C','D','E','F'],  
})

In [30]:
print(table1)

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D
4   5    E
5   6    F

In [43]:
#still unique ID numbers but in a different order
table2 = pd.DataFrame({
    'ID':[3,1,2,4,6,5],
    'transfer_status':['N','Y','Y','Y','Y','N'],
})

In [44]:
display(table1,table2) #prints both tables with one command

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D
4   5    E
5   6    F

   ID transfer_status
0   3               N
1   1               Y
2   2               Y
3   4               Y
4   6               Y
5   5               N

In [50]:
final_table = pd.merge(table1,table2)
print(final_table)

   ID Name transfer_status
0   1    A               Y
1   2    B               Y
2   3    C               N
3   4    D               Y
4   5    E               N
5   6    F               Y

In [55]:
#finding out how many students are listed in the table:
booleans = []
for value in final_table.transfer_status:
    if (value == 'Y'):
        booleans.append(True)
    else:
        booleans.append(False)

In [56]:
len(booleans)

6

In [57]:
#creating a Series using the booleans:
col = pd.Series(booleans)

In [59]:
final_table[col] #now printing all only the students that have their transfer_status as yes

   ID Name transfer_status
0   1    A               Y
1   2    B               Y
3   4    D               Y
5   6    F               Y